[
 {
   "City": "Sapporo",
   "Description": "Sapporo (札幌市 Sapporo-shi) is the fifth largest city of Japan by population, and the largest city on the northern Japanese island of Hokkaido. It is the capital city of Hokkaido Prefecture, and is an ordinance-designated city."
 },
 {
   "City": "Muroran",
   "Description": "Muroran (室蘭市 Muroran-shi) is a city and port located in Iburi Subprefecture, Hokkaido, Japan. It is the capital city of Iburi Subprefecture.As of February 29, 2012, the city has an estimated population of 93,716, with 47,868 households and a population density of 1,162.01 people per km2 (3,009.59 people per sq. mi.). The total area is 80.65 km2 (31.14 sq mi)."
 },
 {
   "City": "Hakodate",
   "Description": "Hakodate (函館市 Hakodate-shi) is a cityand port located in Oshima Subprefecture, Hokkaido, Japan. It is the capital city of Oshima Subprefecture.As of July 31, 2011, the city has an estimated population of 279,851 with 143,221 households, and a population density of 412.83 persons per km2(1,069.2 persons per sq. mi.). The total area is 677.77 km2 (261.69 sq mi). The city is now the third biggest in Hokkaido after Sapporo and Asahikawa."
 },
 {
   "City": "Aomori",
   "Description": "Aomori Prefecture (青森県 Aomori-ken) is a prefecture of Japan located in the Tōhoku region.[2] The capital is the city of Aomori.[3]"
 },
 {
   "City": "Akita",
   "Description": "Akita (飽田町 Akita-machi) was a town located in Hōtaku District, Kumamoto Prefecture, Japan. On February 1, 1991, Akita, along with the towns of Kawachi, Hokubu and Tenmei (all from Hōtaku District), was merged into the expanded city of Kumamoto and no longer exists as an independent municipality. As of April 1, 2012, the area is part of the Minami-ku ward."
 },
 {
   "City": "Morioka",
   "Description": "Morioka (盛岡市 Morioka-shi) is the capital city of Iwate Prefecture located in the Tōhoku region of northern Japan. As of 1 October 2016, the city had an estimated population of 296,739, and a population density of 335 persons per km2. The total area of the city is 886.47 square kilometres (342.27 sq mi)."
 },
 {
   "City": "Yamagata",
   "Description": "Yamagata (山形市 Yamagata-shi, Japanese: [jamaꜜɡata]) is the capital city of Yamagata Prefecture located in the Tōhoku region of northern Japan. As of October 2015, the city had an estimated population of 252,632, and a population density of 663 persons per km². The total area is 381.3 square kilometres (147 sq mi)."
 },
 {
   "City": "Sendai",
   "Description": "Sendai (仙台市 Sendai-shi, Japanese: [seꜜndai]) is the capital city of Miyagi Prefecture, Japan, the largest city in the Tōhoku region, and the second largest city north of Tokyo. As of 1 August 2017, the city had a population of 1,086,012, and is one of Japan's 20 designated cities. The total area of the city is 786.30 square kilometres (303.59 sq mi)."
 },
 {
   "City": "Fukushima",
   "Description": "Fukushima (福島市 Fukushima-shi, [ɸɯ̥kɯꜜɕima]) is the capital city of Fukushima Prefecture, Japan. It is located in the northern part of the Nakadōri, central region of the prefecture. As of 1 April 2017, the city has an estimated population of 280,002 in 122,130 households [2], and a population density of 390 persons per km². The total area of the city was 767.72 square kilometres (296.42 sq mi).[3]"
 },
 {
   "City": "Tokyo",
   "Description": "Tokyo (東京都 Tōkyō-to, literally \"Eastern Capital\") (/ˈtoʊkioʊ/, Japanese: [toːkʲoː] (About this sound listen)), officially Tokyo Metropolis,[6] is the capital city of Japan and one of its 47 prefectures.[7] The Greater Tokyo Area is the most populous metropolitan area in the world.[8] It is the seat of the Emperor of Japan and the Japanese government. "
 },
 {
   "City": "Choshi",
   "Description": "Chōshi (銚子市 Chōshi-shi) is a city located in Chiba Prefecture, Japan. As of February 1, 2016, the city has an estimated population of 64,097, and a population density of 813 persons per km². The total area is 84.19 km2 (32.5 sq mi).[1]"
 },
 {
   "City": "Yokohama",
   "Description": "Yokohama (Japanese: 横浜 Hepburn: Yokohama, pronounced [jokoꜜhama]), literally \"Horizontal Beach\", is the second largest city in Japan by population, after Tokyo, and the most populous municipality of Japan. It is the capital city of Kanagawa Prefecture. It lies on Tokyo Bay, south of Tokyo, in the Kantō region of the main island of Honshu. It is a major commercial hub of the Greater Tokyo Area."
 },
 {
   "City": "Mito",
   "Description": "Mito (水戸市 Mito-shi) is the capital city of Ibaraki Prefecture, in the northern Kantō region of Japan. As of September 2015, the city has an estimated population of 270,953, and a population density of 1,250 persons per km2. Its total area is 217.32 km2."
 },
 {
   "City": "Utsunomiya",
   "Description": "Utsunomiya (宇都宮市 Utsunomiya-shi, Japanese: [ɯᵝt͡sɯ̃ᵝno̞mija̠]) is the capital and largest city of Tochigi Prefecture, in the northern Kantō region of Japan. As of May 2015, the city had an estimated population of 518,200, and a population density of 1,240 persons per square kilometre (3,200/sq mi). Its total area is 416.85 km2 (160.95 sq mi). Utsunomiya is famous for its gyoza (pan fried dumplings). There are more than two hundred gyoza restaurants in Utsunomiya.[1]"
 },
 {
   "City": "Maebashi",
   "Description": "Maebashi (前橋市 Maebashi-shi) is a city located in Gunma Prefecture, in the northern Kantō region of Japan. It is the capital city of Gunma Prefecture.[1]The surrounding cities comprise an urban zone of over 1 million people, separated by farmland to the south from the built up areas of Greater Tokyo."
 },
 {
   "City": "Kumagaya",
   "Description": "Kumagaya (熊谷市 Kumagaya-shi) is a city located in Saitama Prefecture, Japan. As of 1 February 2016, the city had an estimated population of 198,440, and a population density of 1240 persons per km². Its total area is 159.82 square kilometres (61.71 sq mi)."
 },
 {
   "City": "Nagano",
   "Description": "Nagano (長野市 Nagano-shi, Japanese: [nagꜜano]) is the capital city of Nagano Prefecture in the Chūbu region of Japan. As of October 1, 2016, the city had an estimated population of 375,234, and a population density of 449 persons per km². Its total area is 834.81 square kilometres (322.32 sq mi)."
 },
 {
   "City": "Kofu",
   "Description": "Kōfu (甲府市 Kōfu-shi, Japanese: [ko̞ːɸɯᵝ]) is the capital city of Yamanashi Prefecture in Japan. As of November 1, 2015, the city had an estimated population of 193,127 and a population density of 909 persons per km2. The total area was 212.41 square kilometres (82.01 sq mi). Kōfu's name means \"capital of Kai Province\". During the Sengoku period, it was famous as the stronghold of Takeda Shingen."
 },
 {
   "City": "Niigata",
   "Description": "Niigata Prefecture (新潟県 Niigata-ken) is a prefecture located in the Chūbu region of Japan.[1] The capital is the city of Niigata.[2]"
 },
 {
   "City": "Toyama",
   "Description": "Toyama (富山市 Toyama-shi, Japanese: [toꜜjama]) is the capital city of Toyama Prefecture, Japan, located on the coast of the Sea of Japan in the Chūbu region on central Honshū, about 200 km (120 mi) north of the city of Nagoya and 300 km (190 mi) northwest of Tokyo. As of 28 February 2018, the city had an estimated population of 417,878 in 176,643 households,[1] and a population density of 337 persons per km2. Its total area was 1,241.77 square kilometres (479.45 sq mi)."
 },
 {
   "City": "Kanazawa",
   "Description": "Kanazawa (金沢市 Kanazawa-shi) is a city located in Ishikawa Prefecture, Japan. As of 1 January 2018, the city had an estimated population of 466,029 in 203,271 households, and a population density of 290 persons per km².[1] The total area of the city was 468.64 square kilometres (180.94 sq mi). It is the capital of Ishikawa Prefecture."
 },
 {
   "City": "Fukui",
   "Description": "Fukui (福井市 Fukui-shi) is the capital city of Fukui Prefecture, Japan. The city is located in the north-central part of the prefecture on the coast of the Sea of Japan."
 },
 {
   "City": "Nagoya",
   "Description": "Nagoya (名古屋) is the largest city in the Chūbu region of Japan. It is Japan's third-largest incorporated city and the fourth-most-populous urban area. It is located on the Pacific coast on central Honshu. It is the capital of Aichi Prefecture and is one of Japan's major ports along with those of Tokyo, Osaka, Kobe, Yokohama, Chiba, and Kitakyushu. It is also the center of Japan's third-largest metropolitan region, known as the Chūkyō Metropolitan Area. As of 2015, 2.28 million people lived in the city, part of Chūkyō Metropolitan Area's 9.10 million people.[3]"
 },
 {
   "City": "Shizuoka",
   "Description": "Shizuoka (静岡市 Shizuoka-shi, [ɕizɯꜜoka]) SHē-zo͞o-ōkä is the capital city of Shizuoka Prefecture, Japan, and the prefecture's second-largest city in both population and area. It has been populated since prehistoric times."
 },
 {
   "City": "Gifu",
   "Description": "Gifu (岐阜市 Gifu-shi) is a city located in the south-central portion of Gifu Prefecture, Japan, and serves as the prefectural capital. The city has played an important role in Japan's history because of its location in the middle of the country. During the Sengoku period, various warlords, including Oda Nobunaga, used the area as a base in an attempt to unify and control Japan."
 },
 {
   "City": "Tsu",
   "Description": "Tsu (津市 Tsu-shi) is the capital city of Mie Prefecture, Japan. As of August 2015, the city had an estimated population of 279,304 and a population density of 393 persons per km2. The total area was 711.11 square kilometres (274.56 sq mi)."
 },
 {
   "City": "Osaka",
   "Description": "Osaka (大阪市 Ōsaka-shi) (Japanese pronunciation: [oːsaka];) is a designated city in the Kansai region of Japan. It is the capital city of Osaka Prefecture and the largest component of the Keihanshin Metropolitan Area, the second largest metropolitan area in Japan and among the largest in the world with over 19 million inhabitants. Situated at the mouth of the Yodo Riveron Osaka Bay, Osaka is the second largest city in Japan by daytime population after Tokyo's 23 wards and the third largest city by nighttime population after Tokyo's 23 wards and Yokohama, serving as a major economic hub for the country."
 },
 {
   "City": "Hikone",
   "Description": "Hikone (彦根市 Hikone-shi) is a city located in Shiga Prefecture, Japan. It is on the eastern shore of the Lake Biwa. The city was incorporated on February 11, 1937. As of October 1, 2016, the city has an estimated population of 113,349 and a population density of 580 persons per km². The total area is 196.84 km²."
 },
 {
   "City": "Kyoto",
   "Description": "Kyoto (京都市 Kyōto-shi, pronounced [kʲoːꜜto]); UK: /kɪˈoʊtoʊ/, US: /kiˈoʊ-/, or /ˈkjoʊ-/), literally \"Capital City\", is a city located in the central part of the island of Honshu, Japan. It has a population close to 1.5 million. Formerly the Imperial capital of Japan for more than one thousand years, it is now the capital city of Kyoto Prefecture located in the Kansai region, as well as a major part of the Kyoto-Osaka-Kobe metropolitan area."
 },
 {
   "City": "Kobe",
   "Description": "Kobe (神戸市 Kōbe-shi, Japanese: [koːꜜbe]) is the sixth-largest city in Japan and the capital city of Hyōgo Prefecture. It is located on the southern side of the main island of Honshū, on the north shore of Osaka Bay and about 30 km (19 mi) west of Osaka. With a population around 1.5 million, the city is part of the Keihanshin metropolitan area along with Osaka and Kyoto."
 },
 {
   "City": "Nara",
   "Description": "Nara (奈良市 Nara-shi, Japanese: [naꜜɾa]) is the capital city of Nara Prefecture located in the Kansai region of Japan. The city occupies the northern part of Nara Prefecture, bordering Kyoto Prefecture. Eight temples, shrines and ruins in Nara remain: specifically Tōdai-ji, Saidai-ji, Kōfuku-ji, Kasuga Shrine, Gangō-ji, Yakushi-ji, Tōshōdai-ji, and the Heijō Palace, together with Kasugayama Primeval Forest, collectively form \"Historic Monuments of Ancient Nara\", a UNESCO World Heritage Site."
 },
 {
   "City": "Wakayama",
   "Description": "Wakayama (和歌山市 Wakayama-shi, Japanese: [ɰakaꜜjama]) is the capital city of Wakayama Prefecture in the Kansai region of Japan."
 },
 {
   "City": "Hiroshima",
   "Description": "Hiroshima (広島市 Hiroshima-shi, Japanese: [çiɾoɕima]), literally \"Broad Island\", is the capital of Hiroshima Prefecture and the largest city in the Chūgoku region of western Honshu - the largest island of Japan. Hiroshima gained city status on April 1, 1889. On April 1, 1980, Hiroshima became a designated city. As of August 2016, the city has an estimated population of 1,196,274. The gross domestic product (GDP) in Greater Hiroshima, Hiroshima Urban Employment Area, is US$61.3 billion as of 2010.[2][3] Kazumi Matsui has been the city's mayor since April 2011."
 },
 {
   "City": "Okayama",
   "Description": "Okayama (岡山市 Okayama-shi, Japanese: [okaꜜjama]) is the capital city of Okayama Prefecture in the Chūgoku region of Japan. The city was founded on June 1, 1889. As of February 2017, the city has an estimated population of 720,841 and a population density of 910 persons per km².[2] The total area is 789.88 square kilometres (304.97 square miles)."
 },
 {
   "City": "Matsue",
   "Description": "Matsue (松江市 Matsue-shi) is the capital city of Shimane Prefecture located in Chūgoku region of the main island of Honshu.[1][2] As of March, 2017, the city has an estimated population of 205,402, following its most recent merging with the town of Higashiizumo (from Yatsuka District)."
 },
 {
   "City": "Tottori",
   "Description": "Tottori (鳥取市 Tottori-shi) is the capital city of Tottori Prefecture in the Chūgoku region of Japan. As of June 1, 2016, the city has an estimated population of 192,912 and a population density of 250 persons per km2. The total area is 765.31 km2."
 },
 {
   "City": "Shimonoseki",
   "Description": "Shimonoseki (下関市 Shimonoseki-shi) is a city located in Yamaguchi Prefecture, Japan. It is at the southwestern tip of Honshu, facing the Tsushima Strait and also Kitakyushu across the Kanmon Straits. Nicknamed the \"Fugu Capital,\" it is known for the locally caught pufferfish and is the largest harvester of the pufferfish in Japan."
 },
 {
   "City": "Takamatsu",
   "Description": "Takamatsu (高松市 Takamatsu-shi, Japanese: [takaꜜmatsɯ]) is a city located in central Kagawa Prefecture on the island of Shikoku in Japan, and is the capital city of the prefectural government. It is designated a core city by the Japanese Government. It is a port city located on the Seto Inland Sea, and is the closest port to Honshu from Shikoku island. For this reason it flourished under the daimyōs (feudal lords) as a castle town in the fiefdom of Takamatsu, during the Edo period. "
 },
 {
   "City": "Tokushima",
   "Description": "Tokushima Prefecture (徳島県 Tokushima-ken) is a prefecture of Japan located on Shikoku island.[1] The capital is the city of Tokushima. Until the Meiji Restoration, Tokushima Prefecture was known as Awa Province."
 },
 {
   "City": "Matsuyama",
   "Description": "Matsuyama (松山市 Matsuyama-shi, Japanese: [matsɯꜜjama]) is the capital city of Ehime Prefecture on the island of Shikoku in Japan and also Shikoku's largest city, with a population of 516,459 as of December 1, 2014.[1] It is located on the northeastern portion of the Dōgo Plain. Its name means \"pine mountain\". The city was founded on December 15, 1889."
 },
 {
   "City": "Kochi",
   "Description": "Kōchi (河内町 Kōchi-chō) was a town located in Kamo District, Hiroshima Prefecture, Japan. As of 2003, the town had an estimated population of 6,712 and a density of 79.26 persons per km². The total area was 84.68 km²."
 },
 {
   "City": "Fukuoka",
   "Description": "Fukuoka (福岡市 Fukuoka-shi, Japanese: [ɸɯ̥kɯꜜoka]) is the capital city of Fukuoka Prefecture, situated on the northern shore of Japanese island Kyushu. It is the most populous city on the island, followed by Kitakyushu. It is the largest city and metropolitan area west of Keihanshin. The city was designated on April 1, 1972, by government ordinance. Greater Fukuoka, with a population of 2.5 million people (2005 census), is part of the heavily industrialized Fukuoka–Kitakyushu zone."
 },
 {
   "City": "Oita",
   "Description": "Ōita Prefecture (大分県 Ōita-ken) is a prefecture on Kyushu region of Japan.[1] The prefectural capital is the city of Ōita.[2]"
 },
 {
   "City": "Nagasaki",
   "Description": "Nagasaki (長崎市 Nagasaki-shi, Japanese: [naɡaꜜsaki]) is the capital and the largest city of Nagasaki Prefecture on the island of Kyushu in Japan. The city's name, 長崎, means \"long cape\" in Japanese. Nagasaki became a centre of colonial Portuguese and Dutch influence in the 16th through 19th centuries, and Churches and Christian Sites in Nagasaki have been proposed for inscription on the UNESCO World Heritage List. Part of Nagasaki was home to a major Imperial Japanese Navy base during the First Sino-Japanese War and Russo-Japanese War."
 },
 {
   "City": "Saga",
   "Description": "Saga Prefecture (佐賀県 Saga-ken) is a prefecture in the northwest part of the island of Kyushu, Japan.[1] It touches both the Sea of Japan and the Ariake Sea. The western part of the prefecture is a region famous for producing ceramics and porcelain, particularly the towns of Karatsu, Imari, and Arita. The capital is the city of Saga."
 },
 {
   "City": "Kumamoto",
   "Description": "Kumamoto (熊本市 Kumamoto-shi) is the capital city of Kumamoto Prefecture on the island of Kyushu, Japan. As of April 1, 2017, the city has an estimated population of 737,812[3] and a population density of 1,900 persons per km2. The total area is 389.53 km2."
 },
 {
   "City": "Miyazaki",
   "Description": "Miyazaki (宮崎市 Miyazaki-shi, Japanese: [mijaꜜzaki]) is the capital city of Miyazaki Prefecture on the island of Kyushu in Japan. Located on the coast and crossed by several rivers, Miyazaki City enjoys scenic views of both ocean and nearby, verdant mountains. A popular resort destination for Japanese tourists, the city offers many attractions, including the SeaGaia event center (though the indoor ocean facility is no longer operational), the Phoenix Zoo, and many large hotels and onsens (public baths). The city is the primary shopping destination for eastern Kyushu residents in smaller towns around the prefecture. The city was founded on April 1, 1924.[1]"
 },
 {
   "City": "Kagoshima",
   "Description": "Kagoshima (鹿児島市 Kagoshima-shi, Japanese: [ka̠ɡ̃o̞ɕima̠]) is the capital city of Kagoshima Prefecture at the south western tip of the island of Kyushu in Japan, and the largest city in the prefecture by some margin. It has been nicknamed the \"Naples of the Eastern world\" for its bay location (Aira Caldera), hot climate, and emblematic stratovolcano, Sakurajima. The city was officially founded on April 1, 1889."
 },
 {
   "City": "Naha",
   "Description": "Naha (那覇市 Naha-shi, Japanese: [naꜜha], Okinawan: Naafa) is the capital city of Okinawa Prefecture, the southernmost prefecture of Japan. As of December 2012, the city has an estimated population of 321,467[1] and a population density of 8,244.46 persons per km². The total area is 38.99 km²."
 }
]